app/Controllers/AuthController.php

SELECT *
FROM `usuarios`
WHERE `email` = 'demo@email.com'
 LIMIT 1
---
    public function procesarLogin()
    {
        $request = \Config\Services::request(); // Obtener el servicio de solicitud

        $email = $request->getPost('email');
        $password = $request->getPost('password');

        //Verificar que los campos no estén vacíos
        if (empty($email) || empty($password)) {
            return redirect()->to('/login')->with('error', 'El correo electrónico y la contraseña son obligatorios.');
        }
        // Validar que el email tenga un formato correcto
        if (!filter_var($email, FILTER_VALIDATE_EMAIL)) {
            return redirect()->to('/login')->with('error', 'El correo electrónico no es válido.');
        }

        // Si el password no es numérico o no tiene 6 caracteres, redirigir con error
        if (!is_numeric($password) || strlen($password) !== 6) {
            return redirect()->to('/login')->with('error', 'La contraseña debe ser numérica y tener exactamente 6 caracteres.');
        }

        $usuarioModel = new \App\Models\UsuarioModel();
        $usuario = $usuarioModel->where('email', $email)->first();