app/Controllers/MainController.php

        $jugadores = $partidaUsuarioModel->where('idPartida', $idPartida)->findAll();
        $puntajes = [];
        foreach ($jugadores as $jugador) {
            $usuario = $usuarioModel->find($jugador['idUsuario']);
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '1'

        }

        // Estado del tablero
        $query = $db->table('tablero_estado')->where('idPartida', $idPartida)->get();
---
SELECT *
FROM `tablero_estado`
WHERE `idPartida` = '83'