app/Controllers/MainController.php

SELECT `partidas`.*, `tableros`.`filas`, `tableros`.`columnas`
FROM `partidas`
JOIN `tableros` ON `partidas`.`idTablero` = `tableros`.`idTablero`
WHERE `idPartida` = '83'
 LIMIT 1
---
    public function estadoAJAX($idPartida)
    {
        $session = session();
        $idUsuario = $session->get('id');

        $partidaModel = new \App\Models\PartidaModel();
        $partidaUsuarioModel = new \App\Models\PartidaUsuarioModel();
        $usuarioModel = new \App\Models\UsuarioModel();

        // Obtener partida con dimensiones del tablero
        $partida = $partidaModel
            ->select('partidas.*, tableros.filas, tableros.columnas')
            ->join('tableros', 'partidas.idTablero = tableros.idTablero')
            ->where('idPartida', $idPartida)
            ->first();

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '1'
---
            ->where('ordenTurnos', $partida['turnoActual'])
            ->first();

        $nombreJugadorTurno = $usuarioModel->find($jugadorTurno['idUsuario'])['nombreUsuario'];

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '1'
---

        $puntajes = [];
        foreach ($jugadores as $jugador) {
            $usuario = $usuarioModel->find($jugador['idUsuario']);

SELECT *
FROM `tablero_estado`
WHERE `idPartida` = '62'
---
        // Supongamos que lo guardás en una tabla `tablero_estado` con columnas:
        // idPartida, fila, columna, letra
        $db = \Config\Database::connect();
        $query = $db->table('tablero_estado')
            ->where('idPartida', $idPartida)
            ->get();