app/Controllers/PartidaController.php

SELECT *
FROM `partidas`
WHERE `partidas`.`idPartida` = '52'
---
    public function estadoPartida($idPartida)
    {
        $partidaModel = new \App\Models\PartidaModel();
        $partidaUsuarioModel = new \App\Models\PartidaUsuarioModel();

        $partida = $partidaModel->find($idPartida);