app/Controllers/PartidaController.php

INSERT INTO `partidas_usuarios` (`idPartida`, `idUsuario`, `ordenTurnos`, `puntos`) VALUES (52, '1', NULL, 0)
---
        // Insertamos al primer jugador en la partida
        //CORREGIDO: Fue necesario usar el método de conexión directa a la base de datos
        $db = \Config\Database::connect();
        $db->table('partidas_usuarios')->insert([
            'idPartida' => $idPartida,
            'idUsuario' => $idUsuario,
            'ordenTurnos' => null,
            'puntos' => 0
        ]);

SELECT *
FROM `partidas`
WHERE `partidas`.`idPartida` = '43'
---
    public function asignarTurnos($idPartida)
    {
        helper('session');
        $session = session();
        $idUsuario = $session->get('id');

        $partidaModel = new \App\Models\PartidaModel();
        $usuarioPartidaModel = new \App\Models\PartidaUsuarioModel();
        $usuarioModel = new \App\Models\UsuarioModel();

        $partida = $partidaModel->find($idPartida);
        if (!$partida) {
            return redirect()->to('/partida/unirse')->with('error', 'Partida no encontrada.');
        }

        // Verificamos si ya se asignaron turnos
        $hayTurnosAsignados = $usuarioPartidaModel
        ->where('idPartida', $idPartida)
        ->where('ordenTurnos IS NOT', null)
        ->countAllResults() > 0;

        if (!$hayTurnosAsignados) {
            // Obtenemos todos los jugadores de esa partida
            $jugadores = $usuarioPartidaModel
            ->where('idPartida', $idPartida)
            ->findAll();

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '1'
---
        // Obtener nombres
        $jugadoresConNombre = [];
        foreach ($jugadores as $jugador) {
            $usuario = $usuarioModel->find($jugador['idUsuario']);